# Homebrew Bundle for macOS Developer Setup
# Install with: brew bundle

# Essential CLI tools
brew "gh"              # GitHub CLI
brew "git"             # Version control (macOS includes old version)

# Cloud & Infrastructure
brew "awscli"          # AWS CLI
cask "gcloud-cli"      # Google Cloud SDK
cask "session-manager-plugin"  # AWS Session Manager

# Networking
cask "tailscale"       # Mesh VPN

# Development Tools
brew "node"            # Node.js runtime
brew "python"          # Python 3
brew "nmap"            # Network scanning/security

# Security & Secrets Management
cask "1password"       # Password manager (required for bootstrap)
cask "1password-cli"   # 1Password CLI (op command)
cask "mitmproxy"       # HTTP(S) proxy for debugging

# Terminal & Shell
cask "ghostty"         # Terminal emulator
brew "starship"        # Minimal prompt

# Code Editors & IDEs
cask "cursor"          # AI-powered code editor
cask "claude-code"     # Claude Code CLI

# Productivity Apps
cask "raycast"         # Spotlight replacement
cask "notion"          # Notes & documentation
cask "slack"           # Team communication
cask "signal"          # Encrypted messaging
cask "spotify"         # Music

# Hardware Tools
cask "qflipper"        # Flipper Zero management

# Fonts (optional - add your preferred fonts)
# cask "font-jetbrains-mono-nerd-font"
# cask "font-fira-code-nerd-font"
